blog/learning-to-code-first-app-episode-1.tutorial.org
#+TITLE: Manipulating CSV Files in Common Lisp
#+DATE: <2020-06-12 Fri>
#+SUBTITLE: Project »CSV Cleaner« – Episodes: [[file:learning-to-code-first-app-episode-1.tutorial.org][1]] | [[file:learning-to-code-first-ocaml-project-episode-2.tutorial.org][2]] | [[file:first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org][3]]
#+LANGUAGE: en
#+DESCRIPTION: Me coding my first little script in Commmon Lisp, piece by piece | 1st episode
#+KEYWORDS: common lisp, tutorial, first app, learn lisp, csv, cl-csv, lisp scripting
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/learning-to-code-first-app-episode-1.tutorial.html">
#+SETUPFILE: ../static/setup.org
#+OPTIONS: toc:2

* Automate the Boring Stuff with Lisp

I was tired to manipulate CSV tables per hand using spreadsheets, so I wondered how to automate the process and let it contribute to my mission to learn programming. To be honest, this script doesn't do exciting things, but it's trivial enough to serve as a first project.

I believe that the best way to understand something is to teach it (or put differently: if you cannot explain it, you do not really understand it). So I'm going to make a little blog series of it to document my progress, and to extend/refactor the script with each episode, until I'm happy with it or too bored --- whatever happens first.

** Why Common Lisp and not Language XYZ?

~(with-lisp #'automate *the-boring-stuff*)~

I've chosen Lisp, because to me -- an unprejudiced first-time programmer -- Lisp looks like the most simple and comprehensible programming language, after thorough investigation ([[file:best-programming-language-for-beginner.essay.org][read my reasoning here]]).

If you wanna follow along and tinker with the code, download it here. You'll need Common Lisp to run it. [[https://portacle.github.io/][I recommend Portacle]], if there isn't yet any Common Lisp environment installed on your machine.

So welcome to the 1st episode and enjoy the glorious piece of alien technology.

* What the Script should do

Before we start, we'll need to define the features for the little script:

- [X] Open and read a CSV file
- [X] Remove some columns
- [ ] Perform search and replace on cell content
- [ ] Set the pipe '|' as the delimiter char
- [X] Spit out a sweet cleaned CSV file
- [ ] Compile to a standalone binary

/Checked boxes means features implemented in this episode/

* Woohoo, let's begin!

For those who don't know: "CSV" stands for "Comma Separated Values". It is a simple text file that resembles a table: The table rows are represented by rows in the text file, and the table columns by comma-separated values. Assume we've downloaded a CSV named ~orders_export.csv~ with recent orders from our online shop. When we open that file in a text editor, it looks like this example:

#+BEGIN_SRC csv
Order No.,Name,City,Article,Size,Status
1001,Chris,Manchester,Red thong,XXL,Paid
1002,Monica,Adelaide,Yoni eggs,Huge,Payment pending
1003,Hendrik,Stockholm,Hemorrhoid healing stones,9,Paid
#+END_SRC

At first, our little app has to open and read the original CSV file, and then transform the content (let's call it /data/ from now on) into some form it can work with. So we'll need a /data structure/. That's is a generic term for things like lists, tables, trees, arrays, etc. Essentially, data structures are like containers with drawers and compartments.

Let's go with a very simple data structure -- /Yo dawg, I heard you like Lisp? So we'll make every single row a list, and then put those lists into another list, and then you'll have a list of lists!/ That's how we want our data structure to look like; here as a literal repesentation in Lisp code:

#+BEGIN_SRC lisp
'(("Order No." "Name" "City" "Article" "Size" "Status")
  ("1001" "Chris" "Manchester" "Red thong" "XXL" "Paid")
  ("1002" "Monica" "Adelaide" "Yoni eggs" "Huge" "Payment pending")
  ("1003" "Hendrik" "Stockholm" "Hemorrhoid healing stones" "9" "Paid"))
#+END_SRC

