blog/learning-to-code-first-app-episode-1.tutorial.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-03-25 Sat 10:30 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Manipulating CSV Files in Common Lisp</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Me coding my first little script in Commmon Lisp, piece by piece | 1st episode" />
<meta name="keywords" content="common lisp, tutorial, first app, learn lisp, csv, cl-csv, lisp scripting" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-plus/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/mononoki/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/learning-to-code-first-app-episode-1.tutorial.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Manipulating CSV Files in Common Lisp</h1>
<p class="subtitle" role="doc-subtitle">Project »CSV Cleaner« – Episodes: <a href="learning-to-code-first-app-episode-1.tutorial.html">1</a> | <a href="learning-to-code-first-ocaml-project-episode-2.tutorial.html">2</a> | <a href="first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html">3</a></p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3854876">Automate the Boring Stuff with Lisp</a>
<ul>
<li><a href="#orgd93b014">Why Common Lisp and not Language XYZ?</a></li>
</ul>
</li>
<li><a href="#org7335cbd">What the Script should do</a></li>
<li><a href="#orgadfc12a">Woohoo, let&rsquo;s begin!</a>
<ul>
<li><a href="#orgfe440b0">Using the CL-CSV Library</a></li>
<li><a href="#orga01a4b3">Deleting Columns from the CSV</a></li>
</ul>
</li>
<li><a href="#orgf3f88d7">Conclusion</a>
<ul>
<li><a href="#orgd1fc12c">Here is the full Script</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org3854876" class="outline-2">
<h2 id="org3854876">Automate the Boring Stuff with Lisp</h2>
<div class="outline-text-2" id="text-org3854876">
<p>
I was tired to manipulate CSV tables per hand using spreadsheets, so I wondered how to automate the process and let it contribute to my mission to learn programming. To be honest, this script doesn&rsquo;t do exciting things, but it&rsquo;s trivial enough to serve as a first project.<br>
</p>

<p>
I believe that the best way to understand something is to teach it (or put differently: if you cannot explain it, you do not really understand it). So I&rsquo;m going to make a little blog series of it to document my progress, and to extend/refactor the script with each episode, until I&rsquo;m happy with it or too bored &#x2014; whatever happens first.<br>
</p>
</div>

<div id="outline-container-orgd93b014" class="outline-3">
<h3 id="orgd93b014">Why Common Lisp and not Language XYZ?</h3>
<div class="outline-text-3" id="text-orgd93b014">
<p>
<code>(with-lisp #'automate *the-boring-stuff*)</code><br>
</p>

<p>
I&rsquo;ve chosen Lisp, because to me &#x2013; an unprejudiced first-time programmer &#x2013; Lisp looks like the most simple and comprehensible programming language, after thorough investigation (<a href="best-programming-language-for-beginner.essay.html">read my reasoning here</a>).<br>
</p>

<p>
If you wanna follow along and tinker with the code, download it here. You&rsquo;ll need Common Lisp to run it. <a href="https://portacle.github.io/">I recommend Portacle</a>, if there isn&rsquo;t yet any Common Lisp environment installed on your machine.<br>
</p>

<p>
So welcome to the 1st episode and enjoy the glorious piece of alien technology.<br>
</p>
</div>
</div>
</div>

<div id="outline-container-org7335cbd" class="outline-2">
<h2 id="org7335cbd">What the Script should do</h2>
<div class="outline-text-2" id="text-org7335cbd">
<p>
Before we start, we&rsquo;ll need to define the features for the little script:<br>
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Open and read a CSV file<br></li>
<li class="on"><code>[X]</code> Remove some columns<br></li>
<li class="off"><code>[&#xa0;]</code> Perform search and replace on cell content<br></li>
<li class="off"><code>[&#xa0;]</code> Set the pipe &rsquo;|&rsquo; as the delimiter char<br></li>
<li class="on"><code>[X]</code> Spit out a sweet cleaned CSV file<br></li>
<li class="off"><code>[&#xa0;]</code> Compile to a standalone binary<br></li>
</ul>

<p>
<i>Checked boxes means features implemented in this episode</i><br>
</p>
</div>
</div>

<div id="outline-container-orgadfc12a" class="outline-2">
<h2 id="orgadfc12a">Woohoo, let&rsquo;s begin!</h2>
<div class="outline-text-2" id="text-orgadfc12a">
<p>
For those who don&rsquo;t know: &ldquo;CSV&rdquo; stands for &ldquo;Comma Separated Values&rdquo;. It is a simple text file that resembles a table: The table rows are represented by rows in the text file, and the table columns by comma-separated values. Assume we&rsquo;ve downloaded a CSV named <code>orders_export.csv</code> with recent orders from our online shop. When we open that file in a text editor, it looks like this example:<br>
</p>

<div class="org-src-container">
<pre class="src src-csv">Order No.<span class="org-csv-separator">,</span>Name<span class="org-csv-separator">,</span>City<span class="org-csv-separator">,</span>Article<span class="org-csv-separator">,</span>Size<span class="org-csv-separator">,</span>Status
1001<span class="org-csv-separator">,</span>Chris<span class="org-csv-separator">,</span>Manchester<span class="org-csv-separator">,</span>Red thong<span class="org-csv-separator">,</span>XXL<span class="org-csv-separator">,</span>Paid
1002<span class="org-csv-separator">,</span>Monica<span class="org-csv-separator">,</span>Adelaide<span class="org-csv-separator">,</span>Yoni eggs<span class="org-csv-separator">,</span>Huge<span class="org-csv-separator">,</span>Payment pending
1003<span class="org-csv-separator">,</span>Hendrik<span class="org-csv-separator">,</span>Stockholm<span class="org-csv-separator">,</span>Hemorrhoid healing stones<span class="org-csv-separator">,</span>9<span class="org-csv-separator">,</span>Paid
</pre>
</div>

<p>
At first, our little app has to open and read the original CSV file, and then transform the content (let&rsquo;s call it <i>data</i> from now on) into some form it can work with. So we&rsquo;ll need a <i>data structure</i>. That&rsquo;s is a generic term for things like lists, tables, trees, arrays, etc. Essentially, data structures are like containers with drawers and compartments.<br>
</p>

<p>
Let&rsquo;s go with a very simple data structure &#x2013; <i>Yo dawg, I heard you like Lisp? So we&rsquo;ll make every single row a list, and then put those lists into another list, and then you&rsquo;ll have a list of lists!</i> That&rsquo;s how we want our data structure to look like; here as a literal repesentation in Lisp code:<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp">'<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-string">"Order No."</span> <span class="org-string">"Name"</span> <span class="org-string">"City"</span> <span class="org-string">"Article"</span> <span class="org-string">"Size"</span> <span class="org-string">"Status"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-string">"1001"</span> <span class="org-string">"Chris"</span> <span class="org-string">"Manchester"</span> <span class="org-string">"Red thong"</span> <span class="org-string">"XXL"</span> <span class="org-string">"Paid"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-string">"1002"</span> <span class="org-string">"Monica"</span> <span class="org-string">"Adelaide"</span> <span class="org-string">"Yoni eggs"</span> <span class="org-string">"Huge"</span> <span class="org-string">"Payment pending"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-string">"1003"</span> <span class="org-string">"Hendrik"</span> <span class="org-string">"Stockholm"</span> <span class="org-string">"Hemorrhoid healing stones"</span> <span class="org-string">"9"</span> <span class="org-string">"Paid"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>
</div>
