blog/learning-to-code-first-app-episode-1.tutorial.org
** Using the CL-CSV Library

We know how our data should look like, now we have to perform the actual converison to get there. Let's check [[https://github.com/CodyReichert/awesome-cl][Awesome Common Lisp]] for a library to work with CSV files. Turns out, [[https://github.com/CodyReichert/awesome-cl#csv][there's a library /"cl-csv"/]] for that, which is capable to do ... well, a lot of things. Opening files and other stuff included. Neat! So a good chunk of the work is already done by somebody else. That's bad for the learning effect of course, but good for making something happen quickly and getting immediate gratification! :D

To use the functionality from the library, we must load it first. There's [[https://www.quicklisp.org/beta/]["Quicklisp", a package manager for Common Lisp]]. In the REPL, we can use the following command; it downloads the library, saves its code in your ~~/quicklisp/~ directory and loads it into our program:

#+BEGIN_SRC lisp
(ql:quickload "cl-csv")
#+END_SRC

Let's see what is in that library. Ok, there's a function ~cl-csv:read-csv~. We can use it to read the file ~orders_export.csv~ and transform it into the list of lists we want so badly.

How can we define a variable? There's ~defvar~, and we could use ~defparameter~, too. Those are built-in Lisp macros, not from the /cl-csv/ library.

We'll go ahead with ~defparameter~ to define a variable ~*input-table*~ and store the result from the expression ~(cl-csv:read-csv #P"orders_export.csv")~ in it.

#+BEGIN_SRC lisp
(defparameter *input-table* (cl-csv:read-csv #P"orders_export.csv")
"Contains the original table in list form.")
#+END_SRC

#+BEGIN_note
*Let's throw in a little explainer about Lisp source code, shall we?*

You may have guessed it, anything enclosed in parenthesis is a /list/: opening paren ~(some things in between)~ and closing paren. A list in Lisp is foremost a collection of things, one after another, like a list written on paper.

But not just collections of things are written in list form; in fact all the source code is written in list form.

Example: Functions. They are fundamental building blocks in all programs. You define a function (specify what it does) → then apply the function to something → and then it returns a result.

In Lisp, function application looks like this: ~(name-of-the-function 1st-argument 2nd-argument 3rd-argument)~. Noticed the parens? It's a list. The first thing in the list is the function name, and the others are the things we apply the function to. Those we call /arguments/.

Here's an example: ~(+ 1 2 3)~ Yup, that's addition. The ~+~ operator is in fact just a function, applied to the arguments ~1~, ~2~ and ~3~. The function /evaluates/ to ~6~.

The arguments can be anything -- numbers like in the example above, while many functions accept also other things as arguments -- they work on various data structures and even on other functions.

Ok, back to defining variables.
#+END_note

I've read in the [[http://www.lispworks.com/documentation/HyperSpec/Body/m_defpar.htm][documentation for ~defparameter~,]] that it defines a dynamically scoped "global" or "special" variable. Hm. That sounds a bit suspicious, doesn't it? I suspect that's not how you usually should do this. I guess you better use a ~let~ form and lexical scope, not global variables. But I've decided it's fine for now.

I've also read that you mark global/special variables with ~*earmuffs*~ by convention. "Earmuffs". How cute is that? Cold snow ... red apple cheeks ... Well, they could have called them /"sticking out armpit hair bushes"/, too. Guess that was too long.

