blog/learning-to-code-first-app-episode-1.tutorial.html

<div id="outline-container-orgfe440b0" class="outline-3">
<h3 id="orgfe440b0">Using the CL-CSV Library</h3>
<div class="outline-text-3" id="text-orgfe440b0">
<p>
We know how our data should look like, now we have to perform the actual converison to get there. Let&rsquo;s check <a href="https://github.com/CodyReichert/awesome-cl">Awesome Common Lisp</a> for a library to work with CSV files. Turns out, <a href="https://github.com/CodyReichert/awesome-cl#csv">there&rsquo;s a library <i>&ldquo;cl-csv&rdquo;</i></a> for that, which is capable to do &#x2026; well, a lot of things. Opening files and other stuff included. Neat! So a good chunk of the work is already done by somebody else. That&rsquo;s bad for the learning effect of course, but good for making something happen quickly and getting immediate gratification! :D<br>
</p>

<p>
To use the functionality from the library, we must load it first. There&rsquo;s <a href="https://www.quicklisp.org/beta/">&ldquo;Quicklisp&rdquo;, a package manager for Common Lisp</a>. In the REPL, we can use the following command; it downloads the library, saves its code in your <code>~/quicklisp/</code> directory and loads it into our program:<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span>ql:quickload <span class="org-string">"cl-csv"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
Let&rsquo;s see what is in that library. Ok, there&rsquo;s a function <code>cl-csv:read-csv</code>. We can use it to read the file <code>orders_export.csv</code> and transform it into the list of lists we want so badly.<br>
</p>

<p>
How can we define a variable? There&rsquo;s <code>defvar</code>, and we could use <code>defparameter</code>, too. Those are built-in Lisp macros, not from the <i>cl-csv</i> library.<br>
</p>

<p>
We&rsquo;ll go ahead with <code>defparameter</code> to define a variable <code>*input-table*</code> and store the result from the expression <code>(cl-csv:read-csv #P"orders_export.csv")</code> in it.<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*input-table*</span> <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>cl-csv:read-csv #P<span class="org-string">"orders_export.csv"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
<span class="org-doc">"Contains the original table in list form."</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<div class="note" id="org11cee53">
<p>
<b>Let&rsquo;s throw in a little explainer about Lisp source code, shall we?</b><br>
</p>

<p>
You may have guessed it, anything enclosed in parenthesis is a <i>list</i>: opening paren <code>(some things in between)</code> and closing paren. A list in Lisp is foremost a collection of things, one after another, like a list written on paper.<br>
</p>

<p>
But not just collections of things are written in list form; in fact all the source code is written in list form.<br>
</p>

<p>
Example: Functions. They are fundamental building blocks in all programs. You define a function (specify what it does) → then apply the function to something → and then it returns a result.<br>
</p>

<p>
In Lisp, function application looks like this: <code>(name-of-the-function 1st-argument 2nd-argument 3rd-argument)</code>. Noticed the parens? It&rsquo;s a list. The first thing in the list is the function name, and the others are the things we apply the function to. Those we call <i>arguments</i>.<br>
</p>

<p>
Here&rsquo;s an example: <code>(+ 1 2 3)</code> Yup, that&rsquo;s addition. The <code>+</code> operator is in fact just a function, applied to the arguments <code>1</code>, <code>2</code> and <code>3</code>. The function <i>evaluates</i> to <code>6</code>.<br>
</p>

<p>
The arguments can be anything &#x2013; numbers like in the example above, while many functions accept also other things as arguments &#x2013; they work on various data structures and even on other functions.<br>
</p>

<p>
Ok, back to defining variables.<br>
</p>

</div>

<p>
I&rsquo;ve read in the <a href="http://www.lispworks.com/documentation/HyperSpec/Body/m_defpar.htm">documentation for <code>defparameter</code>,</a> that it defines a dynamically scoped &ldquo;global&rdquo; or &ldquo;special&rdquo; variable. Hm. That sounds a bit suspicious, doesn&rsquo;t it? I suspect that&rsquo;s not how you usually should do this. I guess you better use a <code>let</code> form and lexical scope, not global variables. But I&rsquo;ve decided it&rsquo;s fine for now.<br>
</p>

<p>
I&rsquo;ve also read that you mark global/special variables with <code>*earmuffs*</code> by convention. &ldquo;Earmuffs&rdquo;. How cute is that? Cold snow &#x2026; red apple cheeks &#x2026; Well, they could have called them <i>&ldquo;sticking out armpit hair bushes&rdquo;</i>, too. Guess that was too long.<br>
</p>
</div>
</div>
