blog/learning-to-code-first-app-episode-1.tutorial.org
** Deleting Columns from the CSV

Is it a good idea to load the whole CSV at once? Well, probably not. Imagine you have a CSV that is a few gigabytes big. In that case, you would likely work sequentially, for instance load a row, perform your operations on it, store it somehow, and then proceed with the next row. The CSVs I work with are barely bigger than a few megabytes, so I'm going this way for now.

The data structure stored in the variable is a list, and within that list are other lists (I've said that before, didn't I?), each representing a row of the original CSV. Just a quick reminder, it looks like this:

#+BEGIN_SRC lisp
'(("Order No." "Name" "City" "Article" "Size" "Status")
  ("1001" "Chris" "Manchester" "Red thong" "XXL" "Paid")
  ("1002" "Monica" "Adelaide" "Yoni eggs" "Huge" "Payment pending")
  ("1003" "Hendrik" "Stockholm" "Hemorrhoid healing stones" "9" "Paid"))
#+END_SRC

Now we're coming to the point where we're actually doing something: Getting rid of some columns.

The thing is: those columns are not columns like in a spreadsheet. In fact, there are no columns at all. There's actually no column "Name" or "Size", if we just use a list with other lists in it.  All what we have are rows, represented as lists.

So we have to build a relation and make a connection between a particular "column" header -- eg. "Size" -- and the corresponding content -- like "XXL", "Huge" and "9".

Since each row has (hopefully) the same number of strings in it, we can say: when "Size" is the 4th element in the list (counting starts at 0), each corresponding element is always the 4th element in its respective list.

My first idea was to look up the posititions of the columns I don't want to have in the result, and them /remove/ the corresponding strings from all rows (lists).

Example: If don't want the column "Size" appearing in the result, then I'd have to write a function that removes the 4th entry of the header row (list) and also removes the 4th string from each other row (list).

For that, we would need to define all the columns we don't want. We could do that here, directly in the source file in the form of a list of all column headers to get rid of. But then if we want to change something, we would always have to touch the source file ... meh. Better we specify those columns outside of the app's logic in another CSV which will serve as a template. Let's be creative and call it 'template.csv'.

#+BEGIN_note
*So here we'll make a little break to introduce a literary figure: /Future Me/ writing here!*

You've noticed that I was talking the whole time about /removing/ columns? You know what? I had a bit of a hard time to figure out how exactly the filter functions should work to /remove/ the columns/strings. Because each time I delete a specific element from the list, each subsequent element moves one position forward, which makes it really complicated to grab specific elements by their positions.

Then I realized it was way simpler to write a function in a way to /build/ lists from the columns I want to /keep/ in the CSV, instead of writing a function to /remove/ the columns I don't want to have in the result. Two takeaways:

1. If you're stuck with something, it may help to simply switch the perspective.
2. It may be easier to assemble what you want to have eventually, instead of removing what you would like to get rid of.

That being said, let's move on before it gets to deep.
#+END_note

So, within the ~template.csv~ we now have specified all the columns we'd like to /keep/ in our cleaned CSV.

For our next trick, we need those column names from our ~template.csv~, which is also the 1st row in the file. So we'll make sure to pull only that:

The expression ~(cl-csv:read-csv #P"template.csv")~ transforms the content of a CSV file into list of lists, as you may remember (we used that before). Now, with the built-in function ~car~, we'll get the first element of that list, which is the header row:

#+BEGIN_SRC lisp
(defparameter *cols-to-keep-by-name*
  (car (cl-csv:read-csv #P"template.csv"))
"Contains the names of the columns we would like to have in the
cleaned CSV, specified within the first row of the file 'template.csv'")
#+END_SRC

Let's get the table header from our original CSV too (which is still stored in the variable ~*input-table*~ together with the rest of the CSV), and store it separately in another variable called ~*header-input-table*~.

What we have in that variable, looks like that: ~("Order No." "Name" "City" "Article" "Size" "Status")~. The first row has just been copied over (the original table header is still in the ~*input-table*~).

#+BEGIN_SRC lisp
(defparameter *header-input-table* (car *input-table*)
"Contains the original table header, which is the first row
from the file 'orders_export.csv'.")
#+END_SRC

Now we need a function that tells us the position of the column names (and therefore columns) within the original CSV. We write it so that we apply it to the name of a column -- like "Size" -- and then the function tells us in which position the column is.

For that, we're going to use the built-in function [[http://www.lispworks.com/documentation/HyperSpec/Body/f_pos_p.htm][~position~]] within our own function. ~position~ accepts a few parameters to change it's behaviour. The ~:test~ keyword determines under which circumstances the function takes effect. It defaults to the predicate ... well, to which one exactly? I'm not sure. The HyperSpec documentation says nothing about it.

Whatever the default predicate for ~:test~ is -- it doesn't match two strings, even if both are the same. The default test could be either EQ: ~(eq "Vendor" "Vendor") ; → NIL~. But there's an extra predicate that tells us if two strings are the same, and we're going to use that one ~:test #'string=~ instead of the default and ~(string= "Vendor" "Vendor") ; → t~ -- whoop whoop!

#+BEGIN_SRC lisp
(defun get-col-position (col-name)
  "Get the position number of a column by the column name"
  (position col-name *header-input-table* :test #'string=))
#+END_SRC

When we use ~mapcar~ to apply the function ~get-col-position~ to each column name in our list of column headers, the function returns a list with the position numbers of the columns we'd like to have in our cleaned CSV. We store that list in the variable ~*cols-to-keep-by-position*~:

#+BEGIN_SRC lisp
(defparameter *cols-to-keep-by-position*
    (mapcar #'get-col-position *cols-to-keep-by-name*))
#+END_SRC

#+BEGIN_note
It's me again -- former /Future Me/! Merging into your present time line and becoming just me again!

Now we'll reach the point I've mentioned before that had caused me difficulties, and where a perspective switch actually helped:

While I was struggling how to /remove/ from each row the strings belonging to the /unwanted/ columns, I suddenly realized that it was easier to pick the strings corresponding to the /desired/ columns and /collect/ them to construct the rows for the cleaned CSV.

What was still left, was to specify the /desired/ columns via ~template.csv~, instead of the /unwanted/ columns.
#+END_note

Filter the input row:

#+BEGIN_SRC lisp
(defun create-output-row (input-row)
  "Filter a row of the input-table to create a row for the output table"
  (loop for x in *cols-to-keep-by-position*
        collect (nth x input-row)))
#+END_SRC

Create the output-table. We take the function defined above and map it onto each element of the list ~*input-table*~:

#+BEGIN_SRC lisp
(defparameter *output-table*
  (mapcar #'create-output-row *input-table*))
#+END_SRC

Write the new CSV to disk:

#+BEGIN_SRC lisp
(cl-csv:write-csv *output-table* :stream #P"orders_cleaned.csv")
#+END_SRC

