blog/learning-to-code-first-app-episode-1.tutorial.html

<div id="outline-container-orga01a4b3" class="outline-3">
<h3 id="orga01a4b3">Deleting Columns from the CSV</h3>
<div class="outline-text-3" id="text-orga01a4b3">
<p>
Is it a good idea to load the whole CSV at once? Well, probably not. Imagine you have a CSV that is a few gigabytes big. In that case, you would likely work sequentially, for instance load a row, perform your operations on it, store it somehow, and then proceed with the next row. The CSVs I work with are barely bigger than a few megabytes, so I&rsquo;m going this way for now.<br>
</p>

<p>
The data structure stored in the variable is a list, and within that list are other lists (I&rsquo;ve said that before, didn&rsquo;t I?), each representing a row of the original CSV. Just a quick reminder, it looks like this:<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp">'<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-string">"Order No."</span> <span class="org-string">"Name"</span> <span class="org-string">"City"</span> <span class="org-string">"Article"</span> <span class="org-string">"Size"</span> <span class="org-string">"Status"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-string">"1001"</span> <span class="org-string">"Chris"</span> <span class="org-string">"Manchester"</span> <span class="org-string">"Red thong"</span> <span class="org-string">"XXL"</span> <span class="org-string">"Paid"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-string">"1002"</span> <span class="org-string">"Monica"</span> <span class="org-string">"Adelaide"</span> <span class="org-string">"Yoni eggs"</span> <span class="org-string">"Huge"</span> <span class="org-string">"Payment pending"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-string">"1003"</span> <span class="org-string">"Hendrik"</span> <span class="org-string">"Stockholm"</span> <span class="org-string">"Hemorrhoid healing stones"</span> <span class="org-string">"9"</span> <span class="org-string">"Paid"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
Now we&rsquo;re coming to the point where we&rsquo;re actually doing something: Getting rid of some columns.<br>
</p>

<p>
The thing is: those columns are not columns like in a spreadsheet. In fact, there are no columns at all. There&rsquo;s actually no column &ldquo;Name&rdquo; or &ldquo;Size&rdquo;, if we just use a list with other lists in it.  All what we have are rows, represented as lists.<br>
</p>

<p>
So we have to build a relation and make a connection between a particular &ldquo;column&rdquo; header &#x2013; eg. &ldquo;Size&rdquo; &#x2013; and the corresponding content &#x2013; like &ldquo;XXL&rdquo;, &ldquo;Huge&rdquo; and &ldquo;9&rdquo;.<br>
</p>

<p>
Since each row has (hopefully) the same number of strings in it, we can say: when &ldquo;Size&rdquo; is the 4th element in the list (counting starts at 0), each corresponding element is always the 4th element in its respective list.<br>
</p>

<p>
My first idea was to look up the posititions of the columns I don&rsquo;t want to have in the result, and them <i>remove</i> the corresponding strings from all rows (lists).<br>
</p>

<p>
Example: If don&rsquo;t want the column &ldquo;Size&rdquo; appearing in the result, then I&rsquo;d have to write a function that removes the 4th entry of the header row (list) and also removes the 4th string from each other row (list).<br>
</p>

<p>
For that, we would need to define all the columns we don&rsquo;t want. We could do that here, directly in the source file in the form of a list of all column headers to get rid of. But then if we want to change something, we would always have to touch the source file &#x2026; meh. Better we specify those columns outside of the app&rsquo;s logic in another CSV which will serve as a template. Let&rsquo;s be creative and call it &rsquo;template.csv&rsquo;.<br>
</p>

<div class="note" id="org4ab3282">
<p>
<b>So here we&rsquo;ll make a little break to introduce a literary figure: <i>Future Me</i> writing here!</b><br>
</p>

<p>
You&rsquo;ve noticed that I was talking the whole time about <i>removing</i> columns? You know what? I had a bit of a hard time to figure out how exactly the filter functions should work to <i>remove</i> the columns/strings. Because each time I delete a specific element from the list, each subsequent element moves one position forward, which makes it really complicated to grab specific elements by their positions.<br>
</p>

<p>
Then I realized it was way simpler to write a function in a way to <i>build</i> lists from the columns I want to <i>keep</i> in the CSV, instead of writing a function to <i>remove</i> the columns I don&rsquo;t want to have in the result. Two takeaways:<br>
</p>

<ol class="org-ol">
<li>If you&rsquo;re stuck with something, it may help to simply switch the perspective.<br></li>
<li>It may be easier to assemble what you want to have eventually, instead of removing what you would like to get rid of.<br></li>
</ol>

<p>
That being said, let&rsquo;s move on before it gets to deep.<br>
</p>

</div>

<p>
So, within the <code>template.csv</code> we now have specified all the columns we&rsquo;d like to <i>keep</i> in our cleaned CSV.<br>
</p>

<p>
For our next trick, we need those column names from our <code>template.csv</code>, which is also the 1st row in the file. So we&rsquo;ll make sure to pull only that:<br>
</p>

<p>
The expression <code>(cl-csv:read-csv #P"template.csv")</code> transforms the content of a CSV file into list of lists, as you may remember (we used that before). Now, with the built-in function <code>car</code>, we&rsquo;ll get the first element of that list, which is the header row:<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*cols-to-keep-by-name*</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>car <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-3">(</span></span>cl-csv:read-csv #P<span class="org-string">"template.csv"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
<span class="org-doc">"Contains the names of the columns we would like to have in the</span>
<span class="org-doc">cleaned CSV, specified within the first row of the file 'template.csv'"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
Let&rsquo;s get the table header from our original CSV too (which is still stored in the variable <code>*input-table*</code> together with the rest of the CSV), and store it separately in another variable called <code>*header-input-table*</code>.<br>
</p>

<p>
What we have in that variable, looks like that: <code>("Order No." "Name" "City" "Article" "Size" "Status")</code>. The first row has just been copied over (the original table header is still in the <code>*input-table*</code>).<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*header-input-table*</span> <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>car *input-table*<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
<span class="org-doc">"Contains the original table header, which is the first row</span>
<span class="org-doc">from the file 'orders_export.csv'."</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
Now we need a function that tells us the position of the column names (and therefore columns) within the original CSV. We write it so that we apply it to the name of a column &#x2013; like &ldquo;Size&rdquo; &#x2013; and then the function tells us in which position the column is.<br>
</p>

<p>
For that, we&rsquo;re going to use the built-in function <a href="http://www.lispworks.com/documentation/HyperSpec/Body/f_pos_p.htm"><code>position</code></a> within our own function. <code>position</code> accepts a few parameters to change it&rsquo;s behaviour. The <code>:test</code> keyword determines under which circumstances the function takes effect. It defaults to the predicate &#x2026; well, to which one exactly? I&rsquo;m not sure. The HyperSpec documentation says nothing about it.<br>
</p>

<p>
Whatever the default predicate for <code>:test</code> is &#x2013; it doesn&rsquo;t match two strings, even if both are the same. The default test could be either EQ: <code>(eq "Vendor" "Vendor") ; → NIL</code>. But there&rsquo;s an extra predicate that tells us if two strings are the same, and we&rsquo;re going to use that one <code>:test #'string=</code> instead of the default and <code>(string= "Vendor" "Vendor") ; → t</code> &#x2013; whoop whoop!<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defun</span> <span class="org-function-name">get-col-position</span> <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>col-name<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-doc">"Get the position number of a column by the column name"</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>position col-name *header-input-table* <span class="org-builtin">:test</span> #'string=<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
When we use <code>mapcar</code> to apply the function <code>get-col-position</code> to each column name in our list of column headers, the function returns a list with the position numbers of the columns we&rsquo;d like to have in our cleaned CSV. We store that list in the variable <code>*cols-to-keep-by-position*</code>:<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*cols-to-keep-by-position*</span>
    <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>mapcar #'get-col-position *cols-to-keep-by-name*<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<div class="note" id="org3b6e26b">
<p>
It&rsquo;s me again &#x2013; former <i>Future Me</i>! Merging into your present time line and becoming just me again!<br>
</p>

<p>
Now we&rsquo;ll reach the point I&rsquo;ve mentioned before that had caused me difficulties, and where a perspective switch actually helped:<br>
</p>

<p>
While I was struggling how to <i>remove</i> from each row the strings belonging to the <i>unwanted</i> columns, I suddenly realized that it was easier to pick the strings corresponding to the <i>desired</i> columns and <i>collect</i> them to construct the rows for the cleaned CSV.<br>
</p>

<p>
What was still left, was to specify the <i>desired</i> columns via <code>template.csv</code>, instead of the <i>unwanted</i> columns.<br>
</p>

</div>

<p>
Filter the input row:<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defun</span> <span class="org-function-name">create-output-row</span> <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>input-row<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-doc">"Filter a row of the input-table to create a row for the output table"</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-keyword">loop</span> for x in *cols-to-keep-by-position*
        collect <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-3">(</span></span>nth x input-row<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
Create the output-table. We take the function defined above and map it onto each element of the list <code>*input-table*</code>:<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*output-table*</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>mapcar #'create-output-row *input-table*<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
Write the new CSV to disk:<br>
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span>cl-csv:write-csv *output-table* <span class="org-builtin">:stream</span> #P<span class="org-string">"orders_cleaned.csv"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>
</div>
</div>
</div>
