blog/learning-to-code-first-app-episode-1.tutorial.org
* Conclusion

It works! Features 1. and 2. and 5. accomplished. As I've mentioned before, the hard part was to figure out how to actually remove the columns I don't want to have in the CSV; most of the time I was trying to come up with a function to remove some elements by their positions ~(1 3 4)~ from a list ~("a" "b" "c" "d" "e")~. Sometimes you only have to change the perspective, and collecting things seems to be easier than removing things.

** Here is the full Script

To run it, you will need:

1. Common Lisp installation with Quicklisp
2. CSV file named ~orders_export.csv~ with some sample data
3. CSV file ~template.csv~ where you specify the columns to keep

#+begin_src lisp
  ;; Load the library CL-CSV. We use it to read the CSV file and
  ;; transform its content into a list of lists
  (ql:quickload "cl-csv")

  ;; Read the CSV file and store it in a variable as a list of lists
  (defparameter *input-table* (cl-csv:read-csv #P"orders_export.csv"))

  ;; We only need the table headers from the first row from 'template.csv'
  ;; so pull only that and store it in a variable
  (defparameter *cols-to-keep-by-name*
    (car (cl-csv:read-csv #P"template.csv")))

  ;; Get the table header from our original CSV (stored in the variable *input-table*)
  ;; and store it in *header-input-table*
  (defparameter *header-input-table* (car *input-table*))

  ;; Define a function that tells us the position of a particular column name.
  ;; We feed it the name of a column eg. "Size", then it tells us
  ;; at which position that particular column is
  (defun get-col-position (col-name)
    "Get the position number of a column by the column name."
    (position col-name *header-input-table* :test #'string=))

  ;; When we map this function to each column name in our list of column headers,
  ;; we're getting a list of the positions of the columns that we want to keep.
  ;; We store that list in the variable *cols-to-keep-by-position*
  (defparameter *cols-to-keep-by-position*
    (mapcar #'get-col-position *cols-to-keep-by-name*))

  ;; Filter the input row
  (defun create-output-row (input-row)
    "Filter a row of the input-table to create a row for the output table."
    (loop for x in *cols-to-keep-by-position*
          collect (nth x input-row)))

  ;; Create the output-table; take the function above
  ;; and map it onto each element of the list *input-table*
  (defparameter *output-table*
    (mapcar #'create-output-row *input-table*))

  ;; Write the new CSV
  (cl-csv:write-csv *output-table* :stream #P"orders_cleaned.csv")
#+end_src

Ok, that was a first try. [[file:learning-to-code-first-ocaml-project-episode-2.tutorial.org][Check out the 2nd episode]] where I rewrite this in OCaml!
