blog/learning-to-code-first-app-episode-1.tutorial.html

<div id="outline-container-orgf3f88d7" class="outline-2">
<h2 id="orgf3f88d7">Conclusion</h2>
<div class="outline-text-2" id="text-orgf3f88d7">
<p>
It works! Features 1. and 2. and 5. accomplished. As I&rsquo;ve mentioned before, the hard part was to figure out how to actually remove the columns I don&rsquo;t want to have in the CSV; most of the time I was trying to come up with a function to remove some elements by their positions <code>(1 3 4)</code> from a list <code>("a" "b" "c" "d" "e")</code>. Sometimes you only have to change the perspective, and collecting things seems to be easier than removing things.<br>
</p>
</div>

<div id="outline-container-orgd1fc12c" class="outline-3">
<h3 id="orgd1fc12c">Here is the full Script</h3>
<div class="outline-text-3" id="text-orgd1fc12c">
<p>
To run it, you will need:<br>
</p>

<ol class="org-ol">
<li>Common Lisp installation with Quicklisp<br></li>
<li>CSV file named <code>orders_export.csv</code> with some sample data<br></li>
<li>CSV file <code>template.csv</code> where you specify the columns to keep<br></li>
</ol>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Load the library CL-CSV. We use it to read the CSV file and</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">transform its content into a list of lists</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span>ql:quickload <span class="org-string">"cl-csv"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Read the CSV file and store it in a variable as a list of lists</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*input-table*</span> <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>cl-csv:read-csv #P<span class="org-string">"orders_export.csv"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">We only need the table headers from the first row from 'template.csv'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">so pull only that and store it in a variable</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*cols-to-keep-by-name*</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>car <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-3">(</span></span>cl-csv:read-csv #P<span class="org-string">"template.csv"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Get the table header from our original CSV (stored in the variable *input-table*)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">and store it in *header-input-table*</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*header-input-table*</span> <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>car *input-table*<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Define a function that tells us the position of a particular column name.</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">We feed it the name of a column eg. "Size", then it tells us</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">at which position that particular column is</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defun</span> <span class="org-function-name">get-col-position</span> <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>col-name<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-doc">"Get the position number of a column by the column name."</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>position col-name *header-input-table* <span class="org-builtin">:test</span> #'string=<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">When we map this function to each column name in our list of column headers,</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">we're getting a list of the positions of the columns that we want to keep.</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">We store that list in the variable *cols-to-keep-by-position*</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*cols-to-keep-by-position*</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>mapcar #'get-col-position *cols-to-keep-by-name*<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Filter the input row</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defun</span> <span class="org-function-name">create-output-row</span> <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>input-row<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-doc">"Filter a row of the input-table to create a row for the output table."</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-keyword">loop</span> for x in *cols-to-keep-by-position*
        collect <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-3">(</span></span>nth x input-row<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Create the output-table; take the function above</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">and map it onto each element of the list *input-table*</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">defparameter</span> <span class="org-variable-name">*output-table*</span>
  <span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">(</span></span>mapcar #'create-output-row *input-table*<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Write the new CSV</span>
<span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">(</span></span>cl-csv:write-csv *output-table* <span class="org-builtin">:stream</span> #P<span class="org-string">"orders_cleaned.csv"</span><span class="org-parenthesis"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
Ok, that was a first try. <a href="learning-to-code-first-ocaml-project-episode-2.tutorial.html">Check out the 2nd episode</a> where I rewrite this in OCaml!<br>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="footer">Last updated: <span class="date">2022-10-25 Tue 16:12</span></p>
<script defer src="/static/foot.js"></script>
</div>
</body>
</html>
